AppleJennie/my-esp32-projects/moji2-firmware/sdkconfig.defaults
# Moji 2.0 桌面机器人 —— ESP32-C5 默认配置
CONFIG_IDF_TARGET="esp32c5"

# ESP32-C5-WROOM-1-N16R8：16MB Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# 自定义分区表（factory 应用 3MB）
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 主任务栈（表情渲染 + Wi-Fi）
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 如需使用板载 8MB PSRAM（例如后续接 LVGL/GIF 表情），取消下面注释。
# 官方固件实测该模组 PSRAM 为 QUAD 模式（config.json: CONFIG_SPIRAM_MODE_QUAD=y）：
# CONFIG_SPIRAM=y
# CONFIG_SPIRAM_MODE_QUAD=y
# CONFIG_SPIRAM_SPEED_80M=y
